<h1>Finding our best-performing salespeople and products</h1>

<h2>Introduction</h2>

<p><strong>Business Context.</strong> You work for AdventureWorks, a company that sells outdoor sporting equipment. The company has many different locations and has been recording the sales of different locations on various products. You, their new data scientist, have been tasked with the question: <strong>"What are our best products and salespeople and how can use this information to improve our overall performance?"</strong></p>
<p>You have been given access to the relevant data files with documentation from the IT department. Your job is to extract meaningful insights from these data files to help increase sales. First, you will look at the best products and try to see how different products behave in different categories. Second, you will analyze the best salespeople to see if the commission percentage motivates them to sell more.</p>

<p><strong>Business Problem.</strong> Your task is to <strong>construct a database from the provided CSV files and then write queries in SQL to carry out the requested analysis</strong>.</p>

<p><strong>Analytical Context.</strong> You are given the data (stored in the <code>data/csvs</code> folder) as a set of separate CSV files, each one representing a table. You will build a new PostgreSQL database from these files using AWS RDS.</p>
<p>The company has been pretty vague about how they expect you to extract insights, but you have come up with the following plan of attack:</p>
<ol>
<li>Create the database and ensure you can run basic queries against it</li>
<li>Look at how product ratings and total sales are related</li>
<li>See how products sell in different subcategories (bikes, helmets, socks, etc.)</li>
<li>Calculate which salespeople have performed the best in the past year</li>
<li>Seeing if total sales are correlated with their commission percentage</li>
</ol>
<p>Of course, this is only your initial plan. As you explore the database, your strategy will change.</p>

<h2>Setting up AWS</h2>

<p>In this case, we'll assume that the company has given you an entry-level laptop, which is not capable of running a PostgreSQL server locally. Therefore, you should set up a cloud database, connect to it from <code>psql</code>, and run the analysis via the <code>psql</code> or directly from the notebook.</p>

<h3>Question :</h3>
<p>Repeat the steps in Case 12.3 to create a new RDS instance with a PostgreSQL database.</p>

<h2>Overview of the data</h2>

<p>The data for the case is contained in the <code>./data/csvs</code> directory; specifically, it is the <code>AdventureWorks</code> sample data provided by Microsoft. We will be focusing on the Sales and Production categories. Complete documentation for the original data (of which you have only a subset) can be found <a href="https://dataedo.com/download/AdventureWorks.pdf">here</a>. </p>
<p><strong>Product Tables:</strong>
* <strong>Product</strong>: one row per product that the company sells
* <strong>ProductReview</strong>: one row per rating and review left by customers
* <strong>ProductModelProductDescriptionCulture</strong>: a link between products and their longer descriptions also indicating a "culture" - which language and region the product is for
* <strong>ProductDescription</strong>: a longer description of each product, for a specific region
* <strong>ProductCategory</strong>: the broad categories that products fit into
* <strong>ProductSubCategory</strong>: the narrower subcategories that products fit into</p>
<p><strong>Sales Tables:</strong>
* <strong>SalesPerson</strong>: one row per salesperson, including information on their commission and performance
* <strong>SalesOrderHeader</strong>: one row per sale summarizing the sale
* <strong>SalesOrderDetail</strong>: many rows per sale, detailing each product that forms part of the sale
* <strong>SalesTerritory</strong>: the different territories where products are sold, including performance</p>
<p><strong>Region Tables:</strong>
* <strong>CountryRegionCurrency</strong>: the currency used by each region
* <strong>CurrencyRate</strong>: the average and closing exchange rates for each currency compared to the USD</p>

<h2>Using <code>ipython-sql</code> and <code>pgspecial</code></h2>
<p>Jupyter notebook is usually used to run Python code, but with an add-on it can run SQL directly against a database too. The extensions <code>ipython-sql</code> and <code>pgspecial</code> will let you do this.</p>

In [1]:
# Se instalaron las siguientes librerias para poder ejecutar comandos SQL desde Jupyter !pip3 install ipython-sql pgspecial

<p>Load the sql add-on and connect to the database as follows. You'll need to change the username (<code>postgres</code>), password (<code>mysecretpassword</code>), host (<code>localhost</code>), and database name (<code>postgres</code>) to what you used when setting up your RDS instance:</p>

In [1]:
%load_ext sql
#%sql postgresql://postgres:mysecretpassword@localhost/postgres
%sql postgresql://postgres:PostgreSQL@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime

<p>You should now be able to run SQL directly from any Jupyter notebook cell by starting the cell with a line that states <code>%%sql</code>. For example (once you have a database with some tables, which we'll only create later):</p>
<div class="codehilite"><pre><span></span><code><span class="o">%%</span><span class="k">sql</span>

<span class="k">SELECT</span> <span class="o">*</span> <span class="k">FROM</span> <span class="n">product</span> <span class="k">LIMIT</span> <span class="mi">10</span><span class="p">;</span>
</code></pre></div>


<p><strong>Note:</strong> Unlike <code>pandas</code> which automatically truncates output for large DataFrames, the SQL plug-in gives you exactly what you ask for. If you do a <code>SELECT * FROM</code> a table with a million rows and no <code>LIMIT</code> clause, it'll output all million rows and probably freeze your notebook. It's good practice to always use a <code>LIMIT</code> clause even when it's not needed to avoid any mishaps.</p>

<h2>Creating the database and adding the tables</h2>
<p>Now, let's create a database called <code>adventuretime</code>. (If you do this through the notebook, you'll have to add the line <code>end;</code> before your <code>create database</code> command as the add-on runs everything in transactions).</p>
<p>You'll need to add a table for each of the CSV files. Spend some time looking at the different CSV files and getting used to how they reference each other and what headers they create. Then, you'll need to write an appropriate <code>CREATE TABLE</code> command with appropriate types. You can figure out the types by inspecting the CSV files and/or referencing the documentation.</p>

<h3>Exercise 1:</h3>
<p>Write all of the commands that you need to</p>
<ul>
<li>Create the database</li>
<li>Create the tables</li>
<li>Import the data from the CSVs</li>
</ul>
<p><strong>Hint:</strong> As an example, to add data for the <code>salesperson</code> table, you would use the following commands:</p>
<ol>
<li>Create table (can be run from Jupyter Notebook or the <code>psql</code> command line interface):</li>

<div class="codehilite"><pre><span></span><code><span class="k">CREATE</span> <span class="k">TABLE</span> <span class="n">salesperson</span> <span class="p">(</span>
    <span class="n">businessentityid</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">territoryid</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">salesquota</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">bonus</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">commissionpct</span> <span class="nb">FLOAT</span><span class="p">,</span>
    <span class="n">salesytd</span> <span class="nb">FLOAT</span><span class="p">,</span>
    <span class="n">saleslastyear</span> <span class="nb">FLOAT</span><span class="p">,</span>
    <span class="n">rowguid</span> <span class="nb">TEXT</span><span class="p">,</span>
    <span class="n">modifieddate</span> <span class="nb">DATE</span>
    <span class="p">);</span>
</code></pre></div>



<li>Copy data (has to be run from the <code>psql</code> shell):</li>
</ol>
<div class="codehilite"><pre><span></span><code><span class="err">\</span><span class="k">copy</span> <span class="n">salesperson</span> <span class="k">FROM</span> <span class="s1">&#39;data/csvs/salesperson.csv&#39;</span> <span class="k">with</span> <span class="p">(</span><span class="n">format</span> <span class="n">CSV</span><span class="p">,</span> <span class="n">header</span> <span class="k">true</span><span class="p">,</span> <span class="k">delimiter</span> <span class="s1">&#39;,&#39;</span><span class="p">);</span>
</code></pre></div>

In [16]:
%%sql
CREATE TABLE salesperson (
    businessentityid INTEGER,
    territoryid INTEGER,
    salesquota INTEGER,
    bonus INTEGER,
    commissionpct FLOAT,
    salesytd FLOAT,
    saleslastyear FLOAT,
    rowguid TEXT,
    modifieddate DATE
    );

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [17]:
%sql \copy salesperson FROM 'data/csvs/salesperson.csv' with (format CSV, header true, delimiter ',');

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [18]:
%sql select * from salesperson limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(274, None, None, 0, 0.0, 559697.5639, 0.0, '48754992-9ee0-4c0e-8c94-9451604e3e02', datetime.date(2010, 12, 28)),
 (275, 2, 300000, 4100, 0.012, 3763178.1787, 1750406.4785, '1e0a7274-3064-4f58-88ee-4c6586c87169', datetime.date(2011, 5, 24)),
 (276, 4, 250000, 2000, 0.015, 4251368.5497, 1439156.0291, '4dd9eee4-8e81-4f8c-af97-683394c1f7c0', datetime.date(2011, 5, 24))]

In [19]:
%%sql
CREATE TABLE salesterritory(
territoryid INTEGER,
name TEXT,
countryregioncode TEXT,
group1 TEXT,
salesytd FLOAT,
saleslastyear FLOAT,
costytd FLOAT,
costlastyear FLOAT,
rowguid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [20]:
%%sql

\copy salesterritory FROM 'data/csvs/salesterritory.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [21]:
%sql select * from salesterritory limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(1, 'Northwest', 'US', 'North America', 7887186.7882, 3298694.4938, 0.0, 0.0, '43689a10-e30b-497f-b0de-11de20267ff7', datetime.date(2008, 4, 30)),
 (2, 'Northeast', 'US', 'North America', 2402176.8476, 3607148.9371, 0.0, 0.0, '00fb7309-96cc-49e2-8363-0a1ba72486f2', datetime.date(2008, 4, 30)),
 (3, 'Central', 'US', 'North America', 3072175.118, 3205014.0767, 0.0, 0.0, 'df6e7fd8-1a8d-468c-b103-ed8addb452c1', datetime.date(2008, 4, 30))]

In [22]:
%%sql
CREATE TABLE currencyrate(
currencyrateid INTEGER,
currencyratedate DATE,
fromcurrencycode TEXT,
tocurrencycode TEXT,
averagerate FLOAT,
endofdayrate FLOAT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [23]:
%sql \copy currencyrate FROM 'data/csvs/currencyrate.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [24]:
%sql select * from currencyrate limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(1, datetime.date(2011, 5, 31), 'USD', 'ARS', 1.0, 1.0002, datetime.date(2011, 5, 31)),
 (2, datetime.date(2011, 5, 31), 'USD', 'AUD', 1.5491, 1.55, datetime.date(2011, 5, 31)),
 (3, datetime.date(2011, 5, 31), 'USD', 'BRL', 1.9379, 1.9419, datetime.date(2011, 5, 31))]

In [25]:
%%sql
CREATE TABLE countryregioncurrency(
countryregioncode TEXT,
currencycode TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [26]:
%sql \copy countryregioncurrency FROM 'data/csvs/countryregioncurrency.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [27]:
%sql select * from countryregioncurrency limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[('AE', 'AED', datetime.date(2014, 2, 8)),
 ('AR', 'ARS', datetime.date(2014, 2, 8)),
 ('AT', 'ATS', datetime.date(2014, 2, 8))]

In [28]:
%%sql
CREATE TABLE product( 
productid INTEGER,
name TEXT,
productnumber TEXT,
makeflag TEXT,
finishedgoodsflag TEXT,
color TEXT,
safetystocklevel INTEGER,
reorderpoint INTEGER,
standardcost FLOAT,
listprice FLOAT,
size TEXT,
sizeunitmeasurecode TEXT,
weightunitmeasurecode TEXT,
weight FLOAT,
daystomanufacture INTEGER,
productline TEXT,
class1 TEXT,
style TEXT,
productsubcategoryid INTEGER,
productmodelid INTEGER,
sellstartdate DATE,
sellenddate DATE,
discontinueddate DATE,
rowguid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [29]:
%sql \copy product FROM 'data/csvs/product.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [30]:
%sql select * from product limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(1, 'Adjustable Race', 'AR-5381', 'f', 'f', None, 1000, 750, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '694215b7-08f7-4c0d-acb1-d734ba44c0c8', datetime.date(2014, 2, 8)),
 (2, 'Bearing Ball', 'BA-8327', 'f', 'f', None, 1000, 750, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '58ae3c20-4f3a-4749-a7d4-d568806cc537', datetime.date(2014, 2, 8)),
 (3, 'BB Ball Bearing', 'BE-2349', 't', 'f', None, 800, 600, 0.0, 0.0, None, None, None, None, 1, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '9c21aed2-5bfa-4f18-bcb8-f11638dc2e4e', datetime.date(2014, 2, 8))]

In [31]:
%%sql
CREATE TABLE productcategory(
productcategoryid INTEGER,
name TEXT,
rowguid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [32]:
%sql \copy productcategory FROM 'data/csvs/productcategory.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [33]:
%sql select * from productcategory limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(1, 'Bikes', 'cfbda25c-df71-47a7-b81b-64ee161aa37c', datetime.date(2008, 4, 30)),
 (2, 'Components', 'c657828d-d808-4aba-91a3-af2ce02300e9', datetime.date(2008, 4, 30)),
 (3, 'Clothing', '10a7c342-ca82-48d4-8a38-46a2eb089b74', datetime.date(2008, 4, 30))]

In [34]:
%%sql
CREATE TABLE productdescription(
productdescriptionid INTEGER,
description TEXT,
rowguid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [35]:
%sql \copy productdescription FROM 'data/csvs/productdescription.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [36]:
%sql select * from productdescription limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(3, 'Chromoly steel.', '301eed3a-1a82-4855-99cb-2afe8290d641', datetime.date(2013, 4, 30)),
 (4, 'Aluminum alloy cups; large diameter spindle.', 'dfeba528-da11-4650-9d86-cafda7294eb0', datetime.date(2013, 4, 30)),
 (5, 'Aluminum alloy cups and a hollow axle.', 'f7178da7-1a7e-4997-8470-06737181305e', datetime.date(2013, 4, 30))]

In [37]:
%%sql
CREATE TABLE productmodelproductdescriptionculture(
productmodelid INTEGER,
productdescriptionid INTEGER,
cultureid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [38]:
%sql \copy productmodelproductdescriptionculture FROM 'data/csvs/productmodelproductdescriptionculture.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [39]:
%sql select * from productmodelproductdescriptionculture limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(1, 1199, 'en    ', datetime.date(2013, 4, 30)),
 (1, 1467, 'ar    ', datetime.date(2013, 4, 30)),
 (1, 1589, 'fr    ', datetime.date(2013, 4, 30))]

In [40]:
%%sql
CREATE TABLE productreview(
productreviewid INTEGER,
productid INTEGER,
reviewername TEXT,
reviewdate DATE,
emailaddress TEXT,
rating INTEGER,
comments TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [41]:
%sql \copy productreview FROM 'data/csvs/productreview.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [42]:
%sql select * from productreview limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(1, 709, 'John Smith', datetime.date(2013, 9, 18), 'john@fourthcoffee.com', 5, "I can't believe I'm singing the praises of a pair of socks, but I just came back from a grueling\n3-day ride and these socks really helped make the t ... (216 characters truncated) ... it sounds silly, but it's always the little stuff (like comfortable feet) that makes or breaks a long trip.\nI won't go on another trip without them!", datetime.date(2013, 9, 18)),
 (2, 937, 'David', datetime.date(2013, 11, 13), 'david@graphicdesigninstitute.com', 4, "A little on the heavy side, but overall the entry/exit is easy in all conditions. I've used these pedals for \nmore than 3 years and I've never had a ... (43 characters truncated) ... 't get trapped. I would like \nthem even better if there was a weight reduction. Maybe in the next design. Still, I would recommend them to a friend.", datetime.date(2013, 11, 13)),
 (3, 937, 'Jill', datetime.date(2013, 11, 15), 'jill@margiestravel.com', 2, "Maybe it's just because I'm new to mountain biking, but I had a terrible time getting use\nto these pedals. In my first outing, I wiped out trying to release my foot. Any suggestions on\nways I can adjust the pedals, or is it just a learning curve thing?", datetime.date(2013, 11, 15))]

In [43]:
%%sql
CREATE TABLE productsubcategory(
productsubcategoryid INTEGER,
productcategoryid INTEGER,
name TEXT,
rowguid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [44]:
%sql \copy productsubcategory FROM 'data/csvs/productsubcategory.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [45]:
%sql select * from productsubcategory limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(1, 1, 'Mountain Bikes', '2d364ade-264a-433c-b092-4fcbf3804e01', datetime.date(2008, 4, 30)),
 (2, 1, 'Road Bikes', '000310c0-bcc8-42c4-b0c3-45ae611af06b', datetime.date(2008, 4, 30)),
 (3, 1, 'Touring Bikes', '02c5061d-ecdc-4274-b5f1-e91d76bc3f37', datetime.date(2008, 4, 30))]

In [46]:
%%sql
CREATE TABLE salesorderdetail(
salesorderid INTEGER,
salesorderdetailid INTEGER,
carriertrackingnumber TEXT,
orderqty INTEGER,
productid INTEGER,
specialofferid INTEGER,
unitprice FLOAT,
unitpricediscount FLOAT,
rowguid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [47]:
%sql \copy salesorderdetail FROM 'data/csvs/salesorderdetail.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [48]:
%sql select * from salesorderdetail limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(43659, 1, '4911-403C-98', 1, 776, 1, 2024.994, 0.0, 'b207c96d-d9e6-402b-8470-2cc176c42283', datetime.date(2011, 5, 31)),
 (43659, 2, '4911-403C-98', 3, 777, 1, 2024.994, 0.0, '7abb600d-1e77-41be-9fe5-b9142cfc08fa', datetime.date(2011, 5, 31)),
 (43659, 3, '4911-403C-98', 1, 778, 1, 2024.994, 0.0, '475cf8c6-49f6-486e-b0ad-afc6a50cdd2f', datetime.date(2011, 5, 31))]

In [49]:
%%sql
CREATE TABLE salesorderheader(
salesorderid INTEGER,
revisionnumber INTEGER,
orderdate DATE,
duedate DATE,
shipdate DATE,
status INTEGER,
onlineorderflag TEXT,
purchaseordernumber TEXT,
accountnumber TEXT,
customerid INTEGER,
salespersonid INTEGER,
territoryid INTEGER,
billtoaddressid INTEGER,
shiptoaddressid INTEGER,
shipmethodid INTEGER,
creditcardid INTEGER,
creditcardapprovalcode TEXT,
currencyrateid INTEGER,
subtotal FLOAT,
taxamt FLOAT,
freight FLOAT,
totaldue FLOAT,
comment TEXT,
rowguid TEXT,
modifieddate DATE
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
Done.

[]

In [50]:
%sql \copy salesorderheader FROM 'data/csvs/salesorderheader.csv' with (format CSV, header true, delimiter ',')

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
0 rows affected.

[]

In [51]:
%sql select * from salesorderheader limit 3;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(43659, 8, datetime.date(2011, 5, 31), datetime.date(2011, 6, 12), datetime.date(2011, 6, 7), 5, 'f', 'PO522145787', '10-4020-000676', 29825, 279, 5, 985, 985, 5, 16281, '105041Vi84182', None, 20565.6206, 1971.5149, 616.0984, 23153.2339, None, '79b65321-39ca-4115-9cba-8fe0903e12e6', datetime.date(2011, 6, 7)),
 (43660, 8, datetime.date(2011, 5, 31), datetime.date(2011, 6, 12), datetime.date(2011, 6, 7), 5, 'f', 'PO18850127500', '10-4020-000117', 29672, 279, 5, 921, 921, 5, 5618, '115213Vi29411', None, 1294.2529, 124.2483, 38.8276, 1457.3288, None, '738dc42d-d03b-48a1-9822-f95a67ea7389', datetime.date(2011, 6, 7)),
 (43661, 8, datetime.date(2011, 5, 31), datetime.date(2011, 6, 12), datetime.date(2011, 6, 7), 5, 'f', 'PO18473189620', '10-4020-000442', 29734, 282, 6, 517, 517, 5, 1346, '85274Vi6854', 4, 32726.4786, 3153.7696, 985.553, 36865.8012, None, 'd91b9131-18a4-4a11-bc3a-90b6f53e9d74', datetime.date(2011, 6, 7))]

<h2>Finding our most popular products</h2>

<p>As discussed, the company would like to know which of their products is the most popular among customers. You figure that the average rating given in reviews is correlated with the number of sales of a particular product (that products with higher reviews have more sales).</p>

<h3>Exercise 2:</h3>
<p>Using the <code>product</code> and <code>productreview</code> tables, <code>JOIN</code> them and rank the products according to their average review rating. What are the names and IDs of the top 5 products?</p>

**Answer.**

In [52]:
%%sql
SELECT P.productid, P.name, ROUND(AVG(R.rating),2) AS avgrating
FROM product P
JOIN productreview R ON R.productid=P.productid
GROUP BY P.productid,P.name
ORDER BY avgrating DESC
LIMIT 20;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
3 rows affected.

[(798, 'Road-550-W Yellow, 40', Decimal('5.00')),
 (709, 'Mountain Bike Socks, M', Decimal('5.00')),
 (937, 'HL Mountain Pedal', Decimal('3.00'))]

In [119]:
#conexion
%load_ext sql
#%sql postgresql://postgres:mysecretpassword@localhost/postgres
%sql postgresql://postgres:PostgreSQL@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<h3>Exercise 3:</h3>
<p>Much to your disappointment, there are only three products with ratings and only four reviews in total! This is nowhere near enough to perform an analysis of the correlation between reviews and total sales.</p>
<p>Nevertheless, your manager wants the <strong>English description</strong> of these products for an upcoming sale. Use the documentation provided above if you need help navigating the structure to extract this!</p>
<p><strong>Hint:</strong> You'll notice that the value for <code>cultureid</code> in the <code>productmodelproductdescriptionculture</code> table often has extra trailing spaces which makes it difficult to reliably get descriptions of a specific language. You should first modify this table before writing the <code>SELECT</code> statement to get the descriptions that your manager wants. To do this, you can use an <code>UPDATE</code> statement with Postgres's <a href="https://w3resource.com/PostgreSQL/trim-function.php"><code>TRIM</code></a> function.</p>

**Answer.**

In [53]:
%%sql
CREATE TEMP TABLE tmp_description AS (SELECT productid, name, description
FROM product P, productmodelproductdescriptionculture C, productdescription D
WHERE (P.productmodelid = C.productmodelid AND c.productdescriptionid = D.productdescriptionid)
AND C.cultureid LIKE '%en%'
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
294 rows affected.

[]

<h3>Exercise 4:</h3>
<p>Since we cannot infer the most popular products from the reviews, we will go with an alternative strategy.</p>
<p>Get the model ID, name, description, and total number of sales for each product and display the top-10 selling products. You can infer how often products have been sold by looking at the <code>salesorderdetail</code> table (each row might indicate more than one sale, so take note of <code>OrderQty</code>).</p>

**Answer.**

In [54]:
%%sql
SELECT D.productid, name, description, SUM(orderqty) AS CantSales
FROM salesorderdetail S
JOIN tmp_description D ON S.productid=D.productid
GROUP BY D.productid, name, description
ORDER BY CantSales DESC
limit 10;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
10 rows affected.

[(712, 'AWC Logo Cap', 'Traditional style with a flip-up brim; one-size fits all.', 8311),
 (870, 'Water Bottle - 30 oz.', 'AWC logo water bottle - holds 30 oz; leak-proof.', 6815),
 (711, 'Sport-100 Helmet, Blue', 'Universal fit, well-vented, lightweight , snap-on visor.', 6743),
 (715, 'Long-Sleeve Logo Jersey, L', 'Unisex long-sleeve AWC logo microfiber cycling jersey', 6592),
 (708, 'Sport-100 Helmet, Black', 'Universal fit, well-vented, lightweight , snap-on visor.', 6532),
 (707, 'Sport-100 Helmet, Red', 'Universal fit, well-vented, lightweight , snap-on visor.', 6266),
 (864, 'Classic Vest, S', 'Light-weight, wind-resistant, packs to fit into a pocket.', 4247),
 (873, 'Patch Kit/8 Patches', 'Includes 8 different size patches, glue and sandpaper.', 3865),
 (884, 'Short-Sleeve Classic Jersey, XL', 'Short sleeve classic breathable jersey with superior moisture control, front zipper, and 3 back pockets.', 3864),
 (714, 'Long-Sleeve Logo Jersey, M', 'Unisex long-sleeve AWC logo microfiber cycling jersey', 3636)]

<h3>Exercise 5:</h3>
<p>Let's look at the correlation between quantity sold and price for each item in each subcategory. Some subcategories don't have enough sales to make the correlation meaningful, so only look at the top 10 subcategories by total quantity of sales.</p>
<p>Once you've looked at the data, make a hypothesis about what causes any positive or negative correlations between price and quantity, and explain this in 2-3 sentences.</p>
<p><strong>Hint:</strong> You'll need to calculate the total quantities from <code>salesorderdetail</code> again and group the products by subcategory. It'll probably be easier if you use at least two <a href="https://www.postgresql.org/docs/9.1/queries-with.html">CTEs</a>. You can calculate the correlation in PostgreSQL by using the built-in <a href="https://www.postgresql.org/docs/9.4/functions-aggregate.html"><code>corr()</code></a> function.</p>

**Answer.**

In [55]:
%%sql
CREATE TEMP TABLE tmp_prodsubcategory AS (SELECT productid, P.name AS product, S.name AS subcategory
FROM product P
JOIN productsubcategory S ON P.productsubcategoryid = S.productsubcategoryid
GROUP BY productid, product, subcategory
ORDER BY subcategory Desc
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
295 rows affected.

[]

In [56]:
%%sql
WITH topsubcategorysales AS(
SELECT subcategory, SUM(orderqty) AS quantitysales
FROM tmp_prodsubcategory C
JOIN salesorderdetail S ON C.productid = S.productid
GROUP BY subcategory
ORDER BY quantitysales DESC
FETCH FIRST 10 ROWS ONLY), relation AS(
SELECT C.productid, product, subcategory, unitprice, SUM(orderqty) AS quantitysales
FROM tmp_prodsubcategory C
JOIN salesorderdetail S ON C.productid = S.productid
WHERE subcategory IN (SELECT subcategory FROM topsubcategorysales)
GROUP BY subcategory, C.productid, product,unitprice
ORDER BY unitprice DESC)
SELECT corr(unitprice, quantitysales) AS "Coef Correlation"
FROM relation
;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
1 rows affected.

[(-0.219574992129683,)]

**Apparently the data show a strong negative correlation between the unitprice and quantitysales, since the lower the price, the greater the number of sales.
But the correlation coefficient indicates that the relationship between quantity and price is inverse, but very weak.**

<h2>Finding our top salespeople</h2>
<p>As mentioned earlier, we want to find our best salespeople and see whether or not we can incentivize them in an appropriate manner. Namely, we want to determine if the commission percentage we give them motivates them to make more and bigger sales.</p>

<h3>Exercise 5:</h3>
<p>Find the top five performing salespeople by using the <code>salesytd</code> (Sales, year-to-date) column. (We only need to know the <code>businessentityid</code> for each salesperson as this uniquely identifies each.) Why might you be skeptical of these numbers right now?</p>

**Answer.**

In [57]:
%%sql
SELECT businessentityid AS idsales,salesytd
FROM salesperson
ORDER BY salesytd DESC
FETCH FIRST 5 ROWS ONLY

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(276, 4251368.5497),
 (289, 4116871.2277),
 (275, 3763178.1787),
 (277, 3189418.3662),
 (290, 3121616.3202)]

**The values cause skepticism since it is not known to what period of time they correspond and the type of currency with which the sale was made.**

<h3>Exercise 6:</h3>
<p>Using <code>salesorderheader</code>, find the top 5 salespeople who made the most sales <strong>in the most recent year</strong> (2014). (There is a column called <code>subtotal</code> - use that.) Sales that do not have an associated salesperson should be excluded from your calculations and final output. All orders that were made within the 2014 calendar year should be included.</p>
<p><strong>Hint:</strong> You can use the syntax <code>'1970-01-01'::date</code> to generate an arbitrary date in PostgreSQL and compare this to specific dates in the tables.</p>

**Answer.**

In [58]:
%%sql
WITH seller AS (
SELECT businessentityid AS idseller
FROM salesperson)

SELECT salespersonid, SUM(subtotal) AS totalseller
FROM salesorderheader
WHERE salespersonid IN (SELECT idseller FROM seller) and date_trunc('year',orderdate)::date='2014-01-01'
GROUP BY salespersonid
ORDER BY totalseller DESC
FETCH FIRST 5 ROWS ONLY;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(289, 1382996.5839),
 (276, 1271088.5216),
 (275, 1057247.3786),
 (282, 1044810.8277),
 (277, 1040093.4071)]

<h3>Exercise 7:</h3>
<p>Looking at the documentation, you will see that <code>subtotal</code> in the <code>salesorderheader</code> table is calculated from other tables in the database. To validate this figure (instead of trusting it blindly), let's calculate <code>subtotal</code> manually. Using the <code>salesorderdetail</code> and <code>salesorderheader</code> tables, calculate the sales for each salesperson for <strong>this past year</strong> (2014) and display results for the top 5 salespeople.</p>
<p><strong>Hint:</strong> You will have to <code>JOIN</code> <code>salesorderdetail</code> on <code>salesorderheader</code> to get the salesperson, calculate line totals for each sale using appropriate discounts, then sum all the line totals to get the total sale. You will want to use <code>WITH</code> clauses again to keep things sane.</p>

**Answer.**

In [59]:
%%sql

WITH seller AS (
SELECT businessentityid AS idseller
FROM salesperson), subtotal AS (
SELECT salesorderid,SUM(orderqty*(unitprice*(1-unitpricediscount))) AS presale
FROM salesorderdetail
GROUP BY salesorderid
)

SELECT salespersonid, SUM(presale) AS Sales2014
FROM salesorderheader O
JOIN subtotal T ON O.salesorderid=T.salesorderid
WHERE salespersonid IN (SELECT idseller FROM seller) and date_trunc('year',orderdate)::date='2014-01-01'
GROUP BY salespersonid
ORDER BY Sales2014 DESC
FETCH FIRST 5 ROWS ONLY;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
5 rows affected.

[(289, 1382996.58391),
 (276, 1271088.521461),
 (275, 1057247.378572),
 (282, 1044810.827687),
 (277, 1040093.406901)]

<h3>Exercise 8:</h3>
<p>Using <code>corr()</code>, see if there is a positive relationship between total sales and commission percentage.</p>

**Answer.**

In [60]:
%%sql
CREATE TEMP TABLE tmp_sales2014 AS (
WITH seller AS (
SELECT businessentityid AS idseller
FROM salesperson), subtotal AS (
SELECT salesorderid,SUM(orderqty*(unitprice*(1-unitpricediscount))) AS presale
FROM salesorderdetail
GROUP BY salesorderid
)

SELECT salespersonid, SUM(presale) AS Sales2014
FROM salesorderheader O
JOIN subtotal T ON O.salesorderid=T.salesorderid
WHERE salespersonid IN (SELECT idseller FROM seller) and date_trunc('year',orderdate)::date='2014-01-01'
GROUP BY salespersonid
ORDER BY Sales2014 DESC
);

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
17 rows affected.

[]

In [62]:
%%sql
WITH corre AS (SELECT Sales2014,commissionpct
FROM tmp_sales2014 T
JOIN salesperson P ON T.salespersonid=P.businessentityid)

SELECT corr(Sales2014, commissionpct) AS "Coef Correlation"
FROM corre
;

 * postgresql://postgres:***@ds4a.c8bfiyhqx00n.us-east-2.rds.amazonaws.com/adventuretime
1 rows affected.

[(0.737527789211786,)]

<h3>Exercise 9:</h3>
<p>Remember how we mentioned that products were sold in many regions? This is why you had to work with the <code>culture</code> value before to get the English language descriptions. To make matters worse, you are told the sales are recorded in <strong>local</strong> currency, so your previous analysis is flawed, and you must convert all amounts to USD if you wish to compare the different salespeople fairly!</p>
<p>Use the <code>countryregioncurrency</code> table in combination with the <code>salesperson</code> and <code>salesterritory</code> ones to figure out the relevant currency symbol for each of the top salespeople.</p>

**Answer.**

-------

<h3>Exercise 10:</h3>
<p>Now that we have the currency codes associated with each salesperson, redo Exercise 7 to take the currency exchange into account. If there are salespeople in the top 5 that weren't there before, explain why.</p>
<p><strong>Hint:</strong> The rates in the<code>currencyrate</code> table always go from <code>FromCurrencyCode=USD</code> to <code>ToCurrencyCode=&lt;Desired Currency Code&gt;</code>, and they are listed every day. When calculating line totals, use the <code>AverageRate</code> for that day. You should be able to reuse a lot of Exercise 7.</p>

**Answer.**

-------

<h3>Exercise 11:</h3>
<p>How does the correlation from Exercise 8 change once you've adjusted for the currency?</p>

**Answer.**

-------